<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;
use Faker\Generator;
use App\Models\Position;


class PositionSeeder extends Seeder
{

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Position::insert([
            ['title' => 'Директор'],
            ['title' => 'Заступник директора з навчальної роботи'],
            ['title' => 'Засупник директора з навчально - виховної роботи'],
            ['title' => 'Заступник директора з адміністративно - господарської діяльності'],
            ['title' => 'Заступник директора з навчально - виробничої роботи '],
            ['title' => 'Завідувач відділенням'],
            ['title' => 'Завідувач  навчально - виробничими майстернями'],
            ['title' => 'Керівник фізичного виховання'],
            ['title' => 'Вихователь'],
            ['title' => 'Завідувач навчальної лабораторії'],
            ['title' => 'Завідувач навчально - методичної лабораторії'],
            ['title' => 'Завідувач навчально - методичним кабінетом'],
            ['title' => 'Методист'],
            ['title' => 'Методист відділення'],
            ['title' => 'Соціальний педагог'],
            ['title' => 'Практичний психолог'],
            ['title' => 'Завідувач виробничої практики'],
            ['title' => 'Майстер виробничого навчання'],
            ['title' => 'Головний бухгалтер'],
            ['title' => 'Завідувач бібліотеки'],
            ['title' => 'Провідний інженер  з охорони праці'],
            ['title' => 'Начальник штабу цивільної оборони'],
            ['title' => 'Юристконсульт'],
            ['title' => 'Адміністратор бази даних'],
            ['title' => 'Фахівець підрозділу сприяння працевлаштуванню випускників навчального закладу'],
            ['title' => 'Фахівець з профорієнтації випусників навчального закладу ІІ категорії'],
            ['title' => 'Лаборант'],
            ['title' => 'Старший лаборант'],
            ['title' => 'Секретар навчальної частини'],
            ['title' => 'Бібліотекар провідний'],
            ['title' => 'Помічник директора з кадрової роботи'],
            ['title' => 'Старший інспектор з кадрів'],
            ['title' => 'Інспектор з кадрів з обліку студентів'],
            ['title' => 'Бухгалтер провідний'],
            ['title' => 'Бухгалтер І категорії'],
            ['title' => 'Інженер - електронік провідний'],
            ['title' => 'Завідувач канцелярією'],
            ['title' => 'Архіваріус'],
            ['title' => 'Секретар друкарка'],
            ['title' => 'Інженер'],
            ['title' => 'Діловод'],
            ['title' => 'Завідувач господарства'],
            ['title' => 'Диспетчер'],
            ['title' => 'Прибиральник службових приміщень'],
            ['title' => 'Сторож'],
            ['title' => 'Двірник'],
            ['title' => 'Робітник з комплексного обслуговування і ремонту будинків'],
            ['title' => 'Слюсар -сантехнік'],
            ['title' => 'Електромонтер з ремонту та обслуговування електроустаткування'],
            ['title' => 'Викладач'],
            ['title' => 'Економіст провідний'],
            ['title' => 'Сестра медична'],
            ['title' => 'Столяр'],
            ['title' => 'Паспортист'],
            ['title' => 'Завідувач гуртожитку'],
            ['title' => 'Черговий по гуртожитку'],
        ]);

    }
}
